dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/mcan.h
/**
 * \file
 *
 * \brief Component description for MCAN
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2017-08-25T14:00:00Z */
#ifndef _SAME70_MCAN_COMPONENT_H_
#define _SAME70_MCAN_COMPONENT_H_
#define _SAME70_MCAN_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAME_SAME70 Controller Area Network
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR MCAN */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define MCAN_11273                      /**< (MCAN) Module ID */
#define REV_MCAN G                      /**< (MCAN) Module revision */

/* -------- MCAN_CUST : (MCAN Offset: 0x08) (R/W 32) Customer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CSV:32;                    /**< bit:  0..31  Customer-specific Value                  */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_CUST_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_CUST_OFFSET                    (0x08)                                        /**<  (MCAN_CUST) Customer Register  Offset */

#define MCAN_CUST_CSV_Pos                   0                                              /**< (MCAN_CUST) Customer-specific Value Position */
#define MCAN_CUST_CSV_Msk                   (_U_(0xFFFFFFFF) << MCAN_CUST_CSV_Pos)         /**< (MCAN_CUST) Customer-specific Value Mask */
#define MCAN_CUST_CSV(value)                (MCAN_CUST_CSV_Msk & ((value) << MCAN_CUST_CSV_Pos))
#define MCAN_CUST_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (MCAN_CUST) Register MASK  (Use MCAN_CUST_Msk instead)  */
#define MCAN_CUST_Msk                       _U_(0xFFFFFFFF)                                /**< (MCAN_CUST) Register Mask  */


/* -------- MCAN_FBTP : (MCAN Offset: 0x0c) (R/W 32) Fast Bit Timing and Prescaler Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FSJW:2;                    /**< bit:   0..1  Fast (Re) Synchronization Jump Width     */
    uint32_t :2;                        /**< bit:   2..3  Reserved */
    uint32_t FTSEG2:3;                  /**< bit:   4..6  Fast Time Segment After Sample Point     */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t FTSEG1:4;                  /**< bit:  8..11  Fast Time Segment Before Sample Point    */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t FBRP:5;                    /**< bit: 16..20  Fast Baud Rate Prescaler                 */
    uint32_t :2;                        /**< bit: 21..22  Reserved */
    uint32_t TDC:1;                     /**< bit:     23  Transceiver Delay Compensation           */
    uint32_t TDCO:5;                    /**< bit: 24..28  Transceiver Delay Compensation Offset    */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_FBTP_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_FBTP_OFFSET                    (0x0C)                                        /**<  (MCAN_FBTP) Fast Bit Timing and Prescaler Register  Offset */

#define MCAN_FBTP_FSJW_Pos                  0                                              /**< (MCAN_FBTP) Fast (Re) Synchronization Jump Width Position */
#define MCAN_FBTP_FSJW_Msk                  (_U_(0x3) << MCAN_FBTP_FSJW_Pos)               /**< (MCAN_FBTP) Fast (Re) Synchronization Jump Width Mask */
#define MCAN_FBTP_FSJW(value)               (MCAN_FBTP_FSJW_Msk & ((value) << MCAN_FBTP_FSJW_Pos))
#define MCAN_FBTP_FTSEG2_Pos                4                                              /**< (MCAN_FBTP) Fast Time Segment After Sample Point Position */
#define MCAN_FBTP_FTSEG2_Msk                (_U_(0x7) << MCAN_FBTP_FTSEG2_Pos)             /**< (MCAN_FBTP) Fast Time Segment After Sample Point Mask */
#define MCAN_FBTP_FTSEG2(value)             (MCAN_FBTP_FTSEG2_Msk & ((value) << MCAN_FBTP_FTSEG2_Pos))
#define MCAN_FBTP_FTSEG1_Pos                8                                              /**< (MCAN_FBTP) Fast Time Segment Before Sample Point Position */
#define MCAN_FBTP_FTSEG1_Msk                (_U_(0xF) << MCAN_FBTP_FTSEG1_Pos)             /**< (MCAN_FBTP) Fast Time Segment Before Sample Point Mask */
#define MCAN_FBTP_FTSEG1(value)             (MCAN_FBTP_FTSEG1_Msk & ((value) << MCAN_FBTP_FTSEG1_Pos))
#define MCAN_FBTP_FBRP_Pos                  16                                             /**< (MCAN_FBTP) Fast Baud Rate Prescaler Position */
#define MCAN_FBTP_FBRP_Msk                  (_U_(0x1F) << MCAN_FBTP_FBRP_Pos)              /**< (MCAN_FBTP) Fast Baud Rate Prescaler Mask */
#define MCAN_FBTP_FBRP(value)               (MCAN_FBTP_FBRP_Msk & ((value) << MCAN_FBTP_FBRP_Pos))
#define MCAN_FBTP_TDC_Pos                   23                                             /**< (MCAN_FBTP) Transceiver Delay Compensation Position */
#define MCAN_FBTP_TDC_Msk                   (_U_(0x1) << MCAN_FBTP_TDC_Pos)                /**< (MCAN_FBTP) Transceiver Delay Compensation Mask */
#define MCAN_FBTP_TDC                       MCAN_FBTP_TDC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_FBTP_TDC_Msk instead */
#define   MCAN_FBTP_TDC_DISABLED_Val        _U_(0x0)                                       /**< (MCAN_FBTP) Transceiver Delay Compensation disabled.  */
#define   MCAN_FBTP_TDC_ENABLED_Val         _U_(0x1)                                       /**< (MCAN_FBTP) Transceiver Delay Compensation enabled.  */
#define MCAN_FBTP_TDC_DISABLED              (MCAN_FBTP_TDC_DISABLED_Val << MCAN_FBTP_TDC_Pos)  /**< (MCAN_FBTP) Transceiver Delay Compensation disabled. Position  */
#define MCAN_FBTP_TDC_ENABLED               (MCAN_FBTP_TDC_ENABLED_Val << MCAN_FBTP_TDC_Pos)  /**< (MCAN_FBTP) Transceiver Delay Compensation enabled. Position  */
#define MCAN_FBTP_TDCO_Pos                  24                                             /**< (MCAN_FBTP) Transceiver Delay Compensation Offset Position */
#define MCAN_FBTP_TDCO_Msk                  (_U_(0x1F) << MCAN_FBTP_TDCO_Pos)              /**< (MCAN_FBTP) Transceiver Delay Compensation Offset Mask */
#define MCAN_FBTP_TDCO(value)               (MCAN_FBTP_TDCO_Msk & ((value) << MCAN_FBTP_TDCO_Pos))
#define MCAN_FBTP_MASK                      _U_(0x1F9F0F73)                                /**< \deprecated (MCAN_FBTP) Register MASK  (Use MCAN_FBTP_Msk instead)  */
#define MCAN_FBTP_Msk                       _U_(0x1F9F0F73)                                /**< (MCAN_FBTP) Register Mask  */


