dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_CCCR_OFFSET                    (0x18)                                        /**<  (MCAN_CCCR) CC Control Register  Offset */

#define MCAN_CCCR_INIT_Pos                  0                                              /**< (MCAN_CCCR) Initialization (read/write) Position */
#define MCAN_CCCR_INIT_Msk                  (_U_(0x1) << MCAN_CCCR_INIT_Pos)               /**< (MCAN_CCCR) Initialization (read/write) Mask */
#define MCAN_CCCR_INIT                      MCAN_CCCR_INIT_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_INIT_Msk instead */
#define   MCAN_CCCR_INIT_DISABLED_Val       _U_(0x0)                                       /**< (MCAN_CCCR) Normal operation.  */
#define   MCAN_CCCR_INIT_ENABLED_Val        _U_(0x1)                                       /**< (MCAN_CCCR) Initialization is started.  */
#define MCAN_CCCR_INIT_DISABLED             (MCAN_CCCR_INIT_DISABLED_Val << MCAN_CCCR_INIT_Pos)  /**< (MCAN_CCCR) Normal operation. Position  */
#define MCAN_CCCR_INIT_ENABLED              (MCAN_CCCR_INIT_ENABLED_Val << MCAN_CCCR_INIT_Pos)  /**< (MCAN_CCCR) Initialization is started. Position  */
#define MCAN_CCCR_CCE_Pos                   1                                              /**< (MCAN_CCCR) Configuration Change Enable (read/write, write protection) Position */
#define MCAN_CCCR_CCE_Msk                   (_U_(0x1) << MCAN_CCCR_CCE_Pos)                /**< (MCAN_CCCR) Configuration Change Enable (read/write, write protection) Mask */
#define MCAN_CCCR_CCE                       MCAN_CCCR_CCE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_CCE_Msk instead */
#define   MCAN_CCCR_CCE_PROTECTED_Val       _U_(0x0)                                       /**< (MCAN_CCCR) The processor has no write access to the protected configuration registers.  */
#define   MCAN_CCCR_CCE_CONFIGURABLE_Val    _U_(0x1)                                       /**< (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1').  */
#define MCAN_CCCR_CCE_PROTECTED             (MCAN_CCCR_CCE_PROTECTED_Val << MCAN_CCCR_CCE_Pos)  /**< (MCAN_CCCR) The processor has no write access to the protected configuration registers. Position  */
#define MCAN_CCCR_CCE_CONFIGURABLE          (MCAN_CCCR_CCE_CONFIGURABLE_Val << MCAN_CCCR_CCE_Pos)  /**< (MCAN_CCCR) The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1'). Position  */
#define MCAN_CCCR_ASM_Pos                   2                                              /**< (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') Position */
#define MCAN_CCCR_ASM_Msk                   (_U_(0x1) << MCAN_CCCR_ASM_Pos)                /**< (MCAN_CCCR) Restricted Operation Mode (read/write, write protection against '1') Mask */
#define MCAN_CCCR_ASM                       MCAN_CCCR_ASM_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_ASM_Msk instead */
#define   MCAN_CCCR_ASM_NORMAL_Val          _U_(0x0)                                       /**< (MCAN_CCCR) Normal CAN operation.  */
#define   MCAN_CCCR_ASM_RESTRICTED_Val      _U_(0x1)                                       /**< (MCAN_CCCR) Restricted operation mode active.  */
#define MCAN_CCCR_ASM_NORMAL                (MCAN_CCCR_ASM_NORMAL_Val << MCAN_CCCR_ASM_Pos)  /**< (MCAN_CCCR) Normal CAN operation. Position  */
#define MCAN_CCCR_ASM_RESTRICTED            (MCAN_CCCR_ASM_RESTRICTED_Val << MCAN_CCCR_ASM_Pos)  /**< (MCAN_CCCR) Restricted operation mode active. Position  */
#define MCAN_CCCR_CSA_Pos                   3                                              /**< (MCAN_CCCR) Clock Stop Acknowledge (read-only) Position */
#define MCAN_CCCR_CSA_Msk                   (_U_(0x1) << MCAN_CCCR_CSA_Pos)                /**< (MCAN_CCCR) Clock Stop Acknowledge (read-only) Mask */
#define MCAN_CCCR_CSA                       MCAN_CCCR_CSA_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_CSA_Msk instead */
#define MCAN_CCCR_CSR_Pos                   4                                              /**< (MCAN_CCCR) Clock Stop Request (read/write) Position */
#define MCAN_CCCR_CSR_Msk                   (_U_(0x1) << MCAN_CCCR_CSR_Pos)                /**< (MCAN_CCCR) Clock Stop Request (read/write) Mask */
#define MCAN_CCCR_CSR                       MCAN_CCCR_CSR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_CSR_Msk instead */
#define   MCAN_CCCR_CSR_NO_CLOCK_STOP_Val   _U_(0x0)                                       /**< (MCAN_CCCR) No clock stop is requested.  */
#define   MCAN_CCCR_CSR_CLOCK_STOP_Val      _U_(0x1)                                       /**< (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle.  */
#define MCAN_CCCR_CSR_NO_CLOCK_STOP         (MCAN_CCCR_CSR_NO_CLOCK_STOP_Val << MCAN_CCCR_CSR_Pos)  /**< (MCAN_CCCR) No clock stop is requested. Position  */
#define MCAN_CCCR_CSR_CLOCK_STOP            (MCAN_CCCR_CSR_CLOCK_STOP_Val << MCAN_CCCR_CSR_Pos)  /**< (MCAN_CCCR) Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle. Position  */
#define MCAN_CCCR_MON_Pos                   5                                              /**< (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') Position */
#define MCAN_CCCR_MON_Msk                   (_U_(0x1) << MCAN_CCCR_MON_Pos)                /**< (MCAN_CCCR) Bus Monitoring Mode (read/write, write protection against '1') Mask */
#define MCAN_CCCR_MON                       MCAN_CCCR_MON_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_MON_Msk instead */
#define   MCAN_CCCR_MON_DISABLED_Val        _U_(0x0)                                       /**< (MCAN_CCCR) Bus Monitoring mode is disabled.  */
#define   MCAN_CCCR_MON_ENABLED_Val         _U_(0x1)                                       /**< (MCAN_CCCR) Bus Monitoring mode is enabled.  */
#define MCAN_CCCR_MON_DISABLED              (MCAN_CCCR_MON_DISABLED_Val << MCAN_CCCR_MON_Pos)  /**< (MCAN_CCCR) Bus Monitoring mode is disabled. Position  */
#define MCAN_CCCR_MON_ENABLED               (MCAN_CCCR_MON_ENABLED_Val << MCAN_CCCR_MON_Pos)  /**< (MCAN_CCCR) Bus Monitoring mode is enabled. Position  */
#define MCAN_CCCR_DAR_Pos                   6                                              /**< (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) Position */
#define MCAN_CCCR_DAR_Msk                   (_U_(0x1) << MCAN_CCCR_DAR_Pos)                /**< (MCAN_CCCR) Disable Automatic Retransmission (read/write, write protection) Mask */
#define MCAN_CCCR_DAR                       MCAN_CCCR_DAR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_DAR_Msk instead */
#define   MCAN_CCCR_DAR_AUTO_RETX_Val       _U_(0x0)                                       /**< (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled.  */
#define   MCAN_CCCR_DAR_NO_AUTO_RETX_Val    _U_(0x1)                                       /**< (MCAN_CCCR) Automatic retransmission disabled.  */
#define MCAN_CCCR_DAR_AUTO_RETX             (MCAN_CCCR_DAR_AUTO_RETX_Val << MCAN_CCCR_DAR_Pos)  /**< (MCAN_CCCR) Automatic retransmission of messages not transmitted successfully enabled. Position  */
#define MCAN_CCCR_DAR_NO_AUTO_RETX          (MCAN_CCCR_DAR_NO_AUTO_RETX_Val << MCAN_CCCR_DAR_Pos)  /**< (MCAN_CCCR) Automatic retransmission disabled. Position  */
#define MCAN_CCCR_TEST_Pos                  7                                              /**< (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') Position */
#define MCAN_CCCR_TEST_Msk                  (_U_(0x1) << MCAN_CCCR_TEST_Pos)               /**< (MCAN_CCCR) Test Mode Enable (read/write, write protection against '1') Mask */
#define MCAN_CCCR_TEST                      MCAN_CCCR_TEST_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_TEST_Msk instead */
#define   MCAN_CCCR_TEST_DISABLED_Val       _U_(0x0)                                       /**< (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values.  */
#define   MCAN_CCCR_TEST_ENABLED_Val        _U_(0x1)                                       /**< (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled.  */
#define MCAN_CCCR_TEST_DISABLED             (MCAN_CCCR_TEST_DISABLED_Val << MCAN_CCCR_TEST_Pos)  /**< (MCAN_CCCR) Normal operation, MCAN_TEST register holds reset values. Position  */
#define MCAN_CCCR_TEST_ENABLED              (MCAN_CCCR_TEST_ENABLED_Val << MCAN_CCCR_TEST_Pos)  /**< (MCAN_CCCR) Test mode, write access to MCAN_TEST register enabled. Position  */
#define MCAN_CCCR_CME_Pos                   8                                              /**< (MCAN_CCCR) CAN Mode Enable (read/write, write protection) Position */
#define MCAN_CCCR_CME_Msk                   (_U_(0x3) << MCAN_CCCR_CME_Pos)                /**< (MCAN_CCCR) CAN Mode Enable (read/write, write protection) Mask */
#define MCAN_CCCR_CME(value)                (MCAN_CCCR_CME_Msk & ((value) << MCAN_CCCR_CME_Pos))
#define   MCAN_CCCR_CME_ISO11898_1_Val      _U_(0x0)                                       /**< (MCAN_CCCR) CAN operation according to ISO11898-1 enabled  */
#define   MCAN_CCCR_CME_FD_Val              _U_(0x1)                                       /**< (MCAN_CCCR) CAN FD operation enabled  */
#define MCAN_CCCR_CME_ISO11898_1            (MCAN_CCCR_CME_ISO11898_1_Val << MCAN_CCCR_CME_Pos)  /**< (MCAN_CCCR) CAN operation according to ISO11898-1 enabled Position  */
#define MCAN_CCCR_CME_FD                    (MCAN_CCCR_CME_FD_Val << MCAN_CCCR_CME_Pos)    /**< (MCAN_CCCR) CAN FD operation enabled Position  */
#define MCAN_CCCR_CMR_Pos                   10                                             /**< (MCAN_CCCR) CAN Mode Request (read/write) Position */
#define MCAN_CCCR_CMR_Msk                   (_U_(0x3) << MCAN_CCCR_CMR_Pos)                /**< (MCAN_CCCR) CAN Mode Request (read/write) Mask */
#define MCAN_CCCR_CMR(value)                (MCAN_CCCR_CMR_Msk & ((value) << MCAN_CCCR_CMR_Pos))
#define   MCAN_CCCR_CMR_NO_CHANGE_Val       _U_(0x0)                                       /**< (MCAN_CCCR) No mode change  */
#define   MCAN_CCCR_CMR_FD_Val              _U_(0x1)                                       /**< (MCAN_CCCR) Request CAN FD operation  */
#define   MCAN_CCCR_CMR_FD_BITRATE_SWITCH_Val _U_(0x2)                                       /**< (MCAN_CCCR) Request CAN FD operation with bit rate switching  */
#define   MCAN_CCCR_CMR_ISO11898_1_Val      _U_(0x3)                                       /**< (MCAN_CCCR) Request CAN operation according ISO11898-1  */
#define MCAN_CCCR_CMR_NO_CHANGE             (MCAN_CCCR_CMR_NO_CHANGE_Val << MCAN_CCCR_CMR_Pos)  /**< (MCAN_CCCR) No mode change Position  */
#define MCAN_CCCR_CMR_FD                    (MCAN_CCCR_CMR_FD_Val << MCAN_CCCR_CMR_Pos)    /**< (MCAN_CCCR) Request CAN FD operation Position  */
#define MCAN_CCCR_CMR_FD_BITRATE_SWITCH     (MCAN_CCCR_CMR_FD_BITRATE_SWITCH_Val << MCAN_CCCR_CMR_Pos)  /**< (MCAN_CCCR) Request CAN FD operation with bit rate switching Position  */
#define MCAN_CCCR_CMR_ISO11898_1            (MCAN_CCCR_CMR_ISO11898_1_Val << MCAN_CCCR_CMR_Pos)  /**< (MCAN_CCCR) Request CAN operation according ISO11898-1 Position  */
#define MCAN_CCCR_FDO_Pos                   12                                             /**< (MCAN_CCCR) CAN FD Operation (read-only) Position */
#define MCAN_CCCR_FDO_Msk                   (_U_(0x1) << MCAN_CCCR_FDO_Pos)                /**< (MCAN_CCCR) CAN FD Operation (read-only) Mask */
#define MCAN_CCCR_FDO                       MCAN_CCCR_FDO_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_FDO_Msk instead */
#define MCAN_CCCR_FDBS_Pos                  13                                             /**< (MCAN_CCCR) CAN FD Bit Rate Switching (read-only) Position */
#define MCAN_CCCR_FDBS_Msk                  (_U_(0x1) << MCAN_CCCR_FDBS_Pos)               /**< (MCAN_CCCR) CAN FD Bit Rate Switching (read-only) Mask */
#define MCAN_CCCR_FDBS                      MCAN_CCCR_FDBS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_FDBS_Msk instead */
#define MCAN_CCCR_TXP_Pos                   14                                             /**< (MCAN_CCCR) Transmit Pause (read/write, write protection) Position */
#define MCAN_CCCR_TXP_Msk                   (_U_(0x1) << MCAN_CCCR_TXP_Pos)                /**< (MCAN_CCCR) Transmit Pause (read/write, write protection) Mask */
#define MCAN_CCCR_TXP                       MCAN_CCCR_TXP_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_CCCR_TXP_Msk instead */
#define MCAN_CCCR_MASK                      _U_(0x7FFF)                                    /**< \deprecated (MCAN_CCCR) Register MASK  (Use MCAN_CCCR_Msk instead)  */
#define MCAN_CCCR_Msk                       _U_(0x7FFF)                                    /**< (MCAN_CCCR) Register Mask  */


/* -------- MCAN_BTP : (MCAN Offset: 0x1c) (R/W 32) Bit Timing and Prescaler Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SJW:4;                     /**< bit:   0..3  (Re) Synchronization Jump Width          */
    uint32_t TSEG2:4;                   /**< bit:   4..7  Time Segment After Sample Point          */
    uint32_t TSEG1:6;                   /**< bit:  8..13  Time Segment Before Sample Point         */
    uint32_t :2;                        /**< bit: 14..15  Reserved */
    uint32_t BRP:10;                    /**< bit: 16..25  Baud Rate Prescaler                      */
    uint32_t :6;                        /**< bit: 26..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_BTP_Type;
