dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_IR_OFFSET                      (0x50)                                        /**<  (MCAN_IR) Interrupt Register  Offset */

#define MCAN_IR_RF0N_Pos                    0                                              /**< (MCAN_IR) Receive FIFO 0 New Message Position */
#define MCAN_IR_RF0N_Msk                    (_U_(0x1) << MCAN_IR_RF0N_Pos)                 /**< (MCAN_IR) Receive FIFO 0 New Message Mask */
#define MCAN_IR_RF0N                        MCAN_IR_RF0N_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF0N_Msk instead */
#define MCAN_IR_RF0W_Pos                    1                                              /**< (MCAN_IR) Receive FIFO 0 Watermark Reached Position */
#define MCAN_IR_RF0W_Msk                    (_U_(0x1) << MCAN_IR_RF0W_Pos)                 /**< (MCAN_IR) Receive FIFO 0 Watermark Reached Mask */
#define MCAN_IR_RF0W                        MCAN_IR_RF0W_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF0W_Msk instead */
#define MCAN_IR_RF0F_Pos                    2                                              /**< (MCAN_IR) Receive FIFO 0 Full Position */
#define MCAN_IR_RF0F_Msk                    (_U_(0x1) << MCAN_IR_RF0F_Pos)                 /**< (MCAN_IR) Receive FIFO 0 Full Mask */
#define MCAN_IR_RF0F                        MCAN_IR_RF0F_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF0F_Msk instead */
#define MCAN_IR_RF0L_Pos                    3                                              /**< (MCAN_IR) Receive FIFO 0 Message Lost Position */
#define MCAN_IR_RF0L_Msk                    (_U_(0x1) << MCAN_IR_RF0L_Pos)                 /**< (MCAN_IR) Receive FIFO 0 Message Lost Mask */
#define MCAN_IR_RF0L                        MCAN_IR_RF0L_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF0L_Msk instead */
#define MCAN_IR_RF1N_Pos                    4                                              /**< (MCAN_IR) Receive FIFO 1 New Message Position */
#define MCAN_IR_RF1N_Msk                    (_U_(0x1) << MCAN_IR_RF1N_Pos)                 /**< (MCAN_IR) Receive FIFO 1 New Message Mask */
#define MCAN_IR_RF1N                        MCAN_IR_RF1N_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF1N_Msk instead */
#define MCAN_IR_RF1W_Pos                    5                                              /**< (MCAN_IR) Receive FIFO 1 Watermark Reached Position */
#define MCAN_IR_RF1W_Msk                    (_U_(0x1) << MCAN_IR_RF1W_Pos)                 /**< (MCAN_IR) Receive FIFO 1 Watermark Reached Mask */
#define MCAN_IR_RF1W                        MCAN_IR_RF1W_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF1W_Msk instead */
#define MCAN_IR_RF1F_Pos                    6                                              /**< (MCAN_IR) Receive FIFO 1 Full Position */
#define MCAN_IR_RF1F_Msk                    (_U_(0x1) << MCAN_IR_RF1F_Pos)                 /**< (MCAN_IR) Receive FIFO 1 Full Mask */
#define MCAN_IR_RF1F                        MCAN_IR_RF1F_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF1F_Msk instead */
#define MCAN_IR_RF1L_Pos                    7                                              /**< (MCAN_IR) Receive FIFO 1 Message Lost Position */
#define MCAN_IR_RF1L_Msk                    (_U_(0x1) << MCAN_IR_RF1L_Pos)                 /**< (MCAN_IR) Receive FIFO 1 Message Lost Mask */
#define MCAN_IR_RF1L                        MCAN_IR_RF1L_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_RF1L_Msk instead */
#define MCAN_IR_HPM_Pos                     8                                              /**< (MCAN_IR) High Priority Message Position */
#define MCAN_IR_HPM_Msk                     (_U_(0x1) << MCAN_IR_HPM_Pos)                  /**< (MCAN_IR) High Priority Message Mask */
#define MCAN_IR_HPM                         MCAN_IR_HPM_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_HPM_Msk instead */
#define MCAN_IR_TC_Pos                      9                                              /**< (MCAN_IR) Transmission Completed Position */
#define MCAN_IR_TC_Msk                      (_U_(0x1) << MCAN_IR_TC_Pos)                   /**< (MCAN_IR) Transmission Completed Mask */
#define MCAN_IR_TC                          MCAN_IR_TC_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TC_Msk instead */
#define MCAN_IR_TCF_Pos                     10                                             /**< (MCAN_IR) Transmission Cancellation Finished Position */
#define MCAN_IR_TCF_Msk                     (_U_(0x1) << MCAN_IR_TCF_Pos)                  /**< (MCAN_IR) Transmission Cancellation Finished Mask */
#define MCAN_IR_TCF                         MCAN_IR_TCF_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TCF_Msk instead */
#define MCAN_IR_TFE_Pos                     11                                             /**< (MCAN_IR) Tx FIFO Empty Position */
#define MCAN_IR_TFE_Msk                     (_U_(0x1) << MCAN_IR_TFE_Pos)                  /**< (MCAN_IR) Tx FIFO Empty Mask */
#define MCAN_IR_TFE                         MCAN_IR_TFE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TFE_Msk instead */
#define MCAN_IR_TEFN_Pos                    12                                             /**< (MCAN_IR) Tx Event FIFO New Entry Position */
#define MCAN_IR_TEFN_Msk                    (_U_(0x1) << MCAN_IR_TEFN_Pos)                 /**< (MCAN_IR) Tx Event FIFO New Entry Mask */
#define MCAN_IR_TEFN                        MCAN_IR_TEFN_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TEFN_Msk instead */
#define MCAN_IR_TEFW_Pos                    13                                             /**< (MCAN_IR) Tx Event FIFO Watermark Reached Position */
#define MCAN_IR_TEFW_Msk                    (_U_(0x1) << MCAN_IR_TEFW_Pos)                 /**< (MCAN_IR) Tx Event FIFO Watermark Reached Mask */
#define MCAN_IR_TEFW                        MCAN_IR_TEFW_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TEFW_Msk instead */
#define MCAN_IR_TEFF_Pos                    14                                             /**< (MCAN_IR) Tx Event FIFO Full Position */
#define MCAN_IR_TEFF_Msk                    (_U_(0x1) << MCAN_IR_TEFF_Pos)                 /**< (MCAN_IR) Tx Event FIFO Full Mask */
#define MCAN_IR_TEFF                        MCAN_IR_TEFF_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TEFF_Msk instead */
#define MCAN_IR_TEFL_Pos                    15                                             /**< (MCAN_IR) Tx Event FIFO Element Lost Position */
#define MCAN_IR_TEFL_Msk                    (_U_(0x1) << MCAN_IR_TEFL_Pos)                 /**< (MCAN_IR) Tx Event FIFO Element Lost Mask */
#define MCAN_IR_TEFL                        MCAN_IR_TEFL_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TEFL_Msk instead */
#define MCAN_IR_TSW_Pos                     16                                             /**< (MCAN_IR) Timestamp Wraparound Position */
#define MCAN_IR_TSW_Msk                     (_U_(0x1) << MCAN_IR_TSW_Pos)                  /**< (MCAN_IR) Timestamp Wraparound Mask */
#define MCAN_IR_TSW                         MCAN_IR_TSW_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TSW_Msk instead */
#define MCAN_IR_MRAF_Pos                    17                                             /**< (MCAN_IR) Message RAM Access Failure Position */
#define MCAN_IR_MRAF_Msk                    (_U_(0x1) << MCAN_IR_MRAF_Pos)                 /**< (MCAN_IR) Message RAM Access Failure Mask */
#define MCAN_IR_MRAF                        MCAN_IR_MRAF_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_MRAF_Msk instead */
#define MCAN_IR_TOO_Pos                     18                                             /**< (MCAN_IR) Timeout Occurred Position */
#define MCAN_IR_TOO_Msk                     (_U_(0x1) << MCAN_IR_TOO_Pos)                  /**< (MCAN_IR) Timeout Occurred Mask */
#define MCAN_IR_TOO                         MCAN_IR_TOO_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_TOO_Msk instead */
#define MCAN_IR_DRX_Pos                     19                                             /**< (MCAN_IR) Message stored to Dedicated Receive Buffer Position */
#define MCAN_IR_DRX_Msk                     (_U_(0x1) << MCAN_IR_DRX_Pos)                  /**< (MCAN_IR) Message stored to Dedicated Receive Buffer Mask */
#define MCAN_IR_DRX                         MCAN_IR_DRX_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_DRX_Msk instead */
#define MCAN_IR_ELO_Pos                     22                                             /**< (MCAN_IR) Error Logging Overflow Position */
#define MCAN_IR_ELO_Msk                     (_U_(0x1) << MCAN_IR_ELO_Pos)                  /**< (MCAN_IR) Error Logging Overflow Mask */
#define MCAN_IR_ELO                         MCAN_IR_ELO_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_ELO_Msk instead */
#define MCAN_IR_EP_Pos                      23                                             /**< (MCAN_IR) Error Passive Position */
#define MCAN_IR_EP_Msk                      (_U_(0x1) << MCAN_IR_EP_Pos)                   /**< (MCAN_IR) Error Passive Mask */
#define MCAN_IR_EP                          MCAN_IR_EP_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_EP_Msk instead */
#define MCAN_IR_EW_Pos                      24                                             /**< (MCAN_IR) Warning Status Position */
#define MCAN_IR_EW_Msk                      (_U_(0x1) << MCAN_IR_EW_Pos)                   /**< (MCAN_IR) Warning Status Mask */
#define MCAN_IR_EW                          MCAN_IR_EW_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_EW_Msk instead */
#define MCAN_IR_BO_Pos                      25                                             /**< (MCAN_IR) Bus_Off Status Position */
#define MCAN_IR_BO_Msk                      (_U_(0x1) << MCAN_IR_BO_Pos)                   /**< (MCAN_IR) Bus_Off Status Mask */
#define MCAN_IR_BO                          MCAN_IR_BO_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_BO_Msk instead */
#define MCAN_IR_WDI_Pos                     26                                             /**< (MCAN_IR) Watchdog Interrupt Position */
#define MCAN_IR_WDI_Msk                     (_U_(0x1) << MCAN_IR_WDI_Pos)                  /**< (MCAN_IR) Watchdog Interrupt Mask */
#define MCAN_IR_WDI                         MCAN_IR_WDI_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_WDI_Msk instead */
#define MCAN_IR_CRCE_Pos                    27                                             /**< (MCAN_IR) CRC Error Position */
#define MCAN_IR_CRCE_Msk                    (_U_(0x1) << MCAN_IR_CRCE_Pos)                 /**< (MCAN_IR) CRC Error Mask */
#define MCAN_IR_CRCE                        MCAN_IR_CRCE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_CRCE_Msk instead */
#define MCAN_IR_BE_Pos                      28                                             /**< (MCAN_IR) Bit Error Position */
#define MCAN_IR_BE_Msk                      (_U_(0x1) << MCAN_IR_BE_Pos)                   /**< (MCAN_IR) Bit Error Mask */
#define MCAN_IR_BE                          MCAN_IR_BE_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_BE_Msk instead */
#define MCAN_IR_ACKE_Pos                    29                                             /**< (MCAN_IR) Acknowledge Error Position */
#define MCAN_IR_ACKE_Msk                    (_U_(0x1) << MCAN_IR_ACKE_Pos)                 /**< (MCAN_IR) Acknowledge Error Mask */
#define MCAN_IR_ACKE                        MCAN_IR_ACKE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_ACKE_Msk instead */
#define MCAN_IR_FOE_Pos                     30                                             /**< (MCAN_IR) Format Error Position */
#define MCAN_IR_FOE_Msk                     (_U_(0x1) << MCAN_IR_FOE_Pos)                  /**< (MCAN_IR) Format Error Mask */
#define MCAN_IR_FOE                         MCAN_IR_FOE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_FOE_Msk instead */
#define MCAN_IR_STE_Pos                     31                                             /**< (MCAN_IR) Stuff Error Position */
#define MCAN_IR_STE_Msk                     (_U_(0x1) << MCAN_IR_STE_Pos)                  /**< (MCAN_IR) Stuff Error Mask */
#define MCAN_IR_STE                         MCAN_IR_STE_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use MCAN_IR_STE_Msk instead */
#define MCAN_IR_MASK                        _U_(0xFFCFFFFF)                                /**< \deprecated (MCAN_IR) Register MASK  (Use MCAN_IR_Msk instead)  */
#define MCAN_IR_Msk                         _U_(0xFFCFFFFF)                                /**< (MCAN_IR) Register Mask  */


/* -------- MCAN_IE : (MCAN Offset: 0x54) (R/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RF0NE:1;                   /**< bit:      0  Receive FIFO 0 New Message Interrupt Enable */
    uint32_t RF0WE:1;                   /**< bit:      1  Receive FIFO 0 Watermark Reached Interrupt Enable */
    uint32_t RF0FE:1;                   /**< bit:      2  Receive FIFO 0 Full Interrupt Enable     */
    uint32_t RF0LE:1;                   /**< bit:      3  Receive FIFO 0 Message Lost Interrupt Enable */
    uint32_t RF1NE:1;                   /**< bit:      4  Receive FIFO 1 New Message Interrupt Enable */
    uint32_t RF1WE:1;                   /**< bit:      5  Receive FIFO 1 Watermark Reached Interrupt Enable */
    uint32_t RF1FE:1;                   /**< bit:      6  Receive FIFO 1 Full Interrupt Enable     */
    uint32_t RF1LE:1;                   /**< bit:      7  Receive FIFO 1 Message Lost Interrupt Enable */
    uint32_t HPME:1;                    /**< bit:      8  High Priority Message Interrupt Enable   */
    uint32_t TCE:1;                     /**< bit:      9  Transmission Completed Interrupt Enable  */
    uint32_t TCFE:1;                    /**< bit:     10  Transmission Cancellation Finished Interrupt Enable */
    uint32_t TFEE:1;                    /**< bit:     11  Tx FIFO Empty Interrupt Enable           */
    uint32_t TEFNE:1;                   /**< bit:     12  Tx Event FIFO New Entry Interrupt Enable */
    uint32_t TEFWE:1;                   /**< bit:     13  Tx Event FIFO Watermark Reached Interrupt Enable */
    uint32_t TEFFE:1;                   /**< bit:     14  Tx Event FIFO Full Interrupt Enable      */
    uint32_t TEFLE:1;                   /**< bit:     15  Tx Event FIFO Event Lost Interrupt Enable */
    uint32_t TSWE:1;                    /**< bit:     16  Timestamp Wraparound Interrupt Enable    */
    uint32_t MRAFE:1;                   /**< bit:     17  Message RAM Access Failure Interrupt Enable */
    uint32_t TOOE:1;                    /**< bit:     18  Timeout Occurred Interrupt Enable        */
    uint32_t DRXE:1;                    /**< bit:     19  Message stored to Dedicated Receive Buffer Interrupt Enable */
    uint32_t :2;                        /**< bit: 20..21  Reserved */
    uint32_t ELOE:1;                    /**< bit:     22  Error Logging Overflow Interrupt Enable  */
    uint32_t EPE:1;                     /**< bit:     23  Error Passive Interrupt Enable           */
    uint32_t EWE:1;                     /**< bit:     24  Warning Status Interrupt Enable          */
    uint32_t BOE:1;                     /**< bit:     25  Bus_Off Status Interrupt Enable          */
    uint32_t WDIE:1;                    /**< bit:     26  Watchdog Interrupt Enable                */
    uint32_t CRCEE:1;                   /**< bit:     27  CRC Error Interrupt Enable               */
    uint32_t BEE:1;                     /**< bit:     28  Bit Error Interrupt Enable               */
    uint32_t ACKEE:1;                   /**< bit:     29  Acknowledge Error Interrupt Enable       */
    uint32_t FOEE:1;                    /**< bit:     30  Format Error Interrupt Enable            */
    uint32_t STEE:1;                    /**< bit:     31  Stuff Error Interrupt Enable             */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_IE_Type;
